---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFailuresProcessor
source: html/04be4407-94c6-a5f0-a5a4-1ab2a3d831f4.htm
---
# IFailuresProcessor Members

This method is being called in case of exception or document destruction to dismiss any possible pending failure UI that may
 have left on the screen